{
  "bubbles": {
    "0": "Each category groups sellable products, products can be independently in more categories.&nbsp;<br>&nbsp;Categories have: Name, Visibility toggle\n              (hide from POS/customer app), Available time (e.g. breakfast only), and Tax group(secondary). Linked to POS Sales,\n              Manager Setup, and Customer App.",
    "1": "Visibility controls whether the category appears on the POS screen.\n              Available time means you can set a category to only show during specific hours (e.g. breakfast menu\n              7–11am).",
    "2": "Each product must have a name, be assigned to a category, have a set price and tax\n              type(primary. Allergen info is required for compliance. Image can be uploaded for display on the customer-facing\n              screen or app.",
    "3": "Each product links to a recipe that defines what ingredients are used and in what\n              quantities. This allows the system to auto-deduct inventory on each sale and calculate the real cost and\n              profit margin per item.",
    "4": "Manager defines which add-ons are applicable per product. E.g. a Latte can have\n              extra shot, alternative milk, syrup — but a croissant cannot have milk add-on.",
    "5": "Manager selects which items are printable and to which printer (e.g. coffee → bar\n              printer, food → kitchen printer). Receipts can be split. Option to make all bons digital (no paper) is\n              under consideration (marked as question mark in requirements).",
    "6": "Add-ons are optional extras that can be attached to a product during ordering. Each\n              add-on can have its own price and its own recipe (which decreases the relevant inventory on sale). Can be\n              limited per product type.",
    "7": "Every recipe is a list of ingredients with exact quantities. Each ingredient links\n              to an inventory item. When a product is sold, the system automatically decreases stock by the recipe\n              amounts. This enables real-time cost calculation and profit tracking.",
    "8": "Not everything in inventory is a sellable product. The system tracks all physical\n              items: raw ingredients (coffee beans, milk), disposables (cups, napkins), hygiene products, equipment, and\n              office supplies. Each has its own tracking logic.",
    "9": "Unit defines how the item is measured (grams, ml, pcs). Minimum stock triggers an\n              alert when stock falls below the threshold. Cost per unit feeds into the profit calculation. Storage\n              location helps staff physically find items.",
    "10": "When a product is sold at POS, the system reads the recipe and automatically\n              decreases each ingredient's stock. No manual counting needed during service.",
    "11": "Stock increases when a supplier invoice is uploaded and processed. Staff can also\n              manually adjust stock (e.g. after a stocktake). Waste or loss can be recorded separately to track\n              shrinkage.",
    "12": "Manager uploads a scanned or digital invoice. The system reads the items and\n              quantities and increases the relevant inventory items. The cost is stored and linked to finance expenses.\n              AI can learn from purchase patterns over time.",
    "13": "When stock drops below minimum threshold, the system notifies the responsible\n              person (push / in-app) and shows a warning on the manager dashboard. This prevents running out of\n              ingredients mid-service.",
    "14": "Staff select products from the visual catalog, apply add-ons, set quantities. The\n              order summary shows real-time totals including add-on prices and applicable discounts.",
    "15": "Staff can apply manual discounts (if permitted by role) or redeem a customer's\n              loyalty points/vouchers at checkout. All discounts are logged for finance and fraud prevention.",
    "16": "Multiple payment methods can be combined for a single order (split payment). Each\n              payment type is tracked separately for the daily financial close and cash reconciliation.",
    "17": "When an order is placed, it is pushed to the relevant station (bar, kitchen). Push\n              notifications and proximity alerts can be configured. Order status (received → making → ready → served) is\n              tracked in real time.",
    "18": "Orders can be tied to a table number. Multiple orders can be open per table. Tables\n              can be merged or split for billing.",
    "19": "At start/end of shift, staff declare cash in the register. The system compares\n              declared amount vs calculated amount from sales. Cash moved to the tresor (safe) is also tracked.\n              Discrepancies are flagged.",
    "20": "Every completed sale generates a full financial record: what was sold, how it was\n              paid, which tax rate applied, and what the profit was (based on recipe costs). This feeds directly into\n              the Finance module.",
    "21": "Online orders flow into the same order management system. External delivery service\n              integrations allow tracking delivery status. Note: Bolt Food is explicitly excluded from integration\n              scope.",
    "22": "Income is tracked by source so the owner can see which revenue stream performs\n              best. E-shop, catering, and events are tracked separately from daily POS sales. Wholesale (bulk orders for\n              other businesses) is also a channel.",
    "23": "Expenses are categorised for clear P&amp;L reporting. Inventory costs come\n              automatically from invoice uploads. Salaries are pulled from HR. Other expenses are entered manually or\n              via integrations.",
    "24": "The finance dashboard shows a real-time overview of all income and expenses.\n              Revenue vs costs gives live profit. Cash vs Card breakdown supports cash reconciliation. Tax record keeps\n              the business compliant.",
    "25": "Each employee has a profile with their personal data, contract type (full-time,\n              part-time, temp), hourly wage or monthly salary, and remaining vacation days. Permissions determine which\n              screens and actions they can access.",
    "26": "Staff clock in/out via the app. If they forget, they can request a manual\n              correction which a manager must approve. On shared devices (e.g. a kitchen tablet), the system auto-logs\n              out when a shift ends to prevent unauthorized access.",
    "27": "Managers create the shift schedule on a calendar view. Staff can request shift\n              swaps with colleagues. Swap requests must be approved by a manager before they take effect. Staff can see\n              their own schedule on their phone.",
    "28": "Each employee can see their own payroll summary: total hours this month, calculated\n              earnings based on their wage, any bonuses, and remaining vacation days. Managers see this for all staff.\n              Finance module receives the salary total as an expense.",
    "29": "A responsibility is a recurring or one-time task assigned to a role or specific\n              person. It has a frequency (daily, weekly, per shift), a primary assignee, and a backup who takes over if\n              the primary is absent. Examples: opening checklist, cleaning schedule, stock count.",
    "30": "Every time a responsibility is due, a log entry is created. Staff mark it as\n              completed. If not completed in time, it is marked as missed. Managers can see a full log of completed and\n              missed responsibilities per person or shift.",
    "31": "If the assigned person is absent (no active shift), the task is automatically\n              transferred to the backup person. A push notification is sent to the backup so nothing is missed.",
    "32": "Each registered customer has a profile with contact info, visit history,\n              accumulated loyalty points, and preference data (favourite drinks, allergen notes). This powers\n              personalised campaigns and rewards.",
    "33": "Customers earn points per purchase. Points can be redeemed for free products,\n              discounts, or special offers. Reward thresholds and values are set by the manager. Loyalty tiers\n              (bronze/silver/gold) can be added later.",
    "34": "Engagement features to keep customers coming back: monthly leaderboard, collectible\n              badges for milestones (10th visit, first purchase etc), spin-the-wheel for random prizes, and surprise\n              free breakfast for top customers.",
    "35": "Campaigns can be sent via multiple channels from one builder. Customers can choose\n              their preferred channel. WhatsApp and Telegram are priority channels for the Czech/Slovak market.",
    "36": "Manager selects a customer segment (e.g. all customers who haven't visited in 14\n              days), writes the message, schedules it, and sends. Results (open rate, redemptions) are tracked per\n              campaign.",
    "37": "AI bots handle routine outreach: birthday messages, re-engagement for lapsed\n              customers, automated follow-ups after a purchase. Rules and templates are set by manager; bots execute\n              automatically.",
    "38": "The AI continuously analyses all data flowing through the system: daily sales\n              patterns, which products are trending, how fast stock is consumed, what the labor cost vs revenue ratio\n              looks like, and optionally benchmarks against anonymized industry data.",
    "39": "AI detects patterns like \"you always over-order milk on Mondays\" or \"this\n              ingredient has 20% waste rate\" and suggests ordering adjustments or recipe tweaks to reduce cost.",
    "40": "AI identifies high-margin items that aren't selling enough and suggests promotions,\n              or flags low-margin products that take too much time. Menu optimization recommendations are shown to the\n              manager as actionable cards.",
    "41": "AI analyses peak hours vs staffing levels and suggests optimal shift patterns. If\n              labor cost is too high relative to revenue on certain days, it flags it with a recommendation."
  },
  "roles": {
    "0": "\n            Highest platform-level role. Full access to everything across all businesses and branches.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>Access all businesses and branches</li>\n                <li>Platform-wide settings</li>\n                <li>Manage pricing plans / modules</li>\n                <li>View all data, logs, errors</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Restrictions</div>\n              <ul>\n                <li>None — full access</li>\n              </ul>\n            </div>\n          ",
    "1": "\n            Represents a company that owns one or more branches. Manages company-wide data.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>Create &amp; manage branches</li>\n                <li>Set company info, billing</li>\n                <li>View all-branch analytics</li>\n                <li>Manage modules per branch</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>Access other businesses' data</li>\n                <li>Platform-level settings</li>\n              </ul>\n            </div>\n          ",
    "2": "\n            Manages a single branch. Full operational control within that branch.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>All POS, inventory, staff management</li>\n                <li>Approve time corrections &amp; shift swaps</li>\n                <li>Upload invoices, configure products</li>\n                <li>View branch analytics &amp; finance</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>Modify platform or company billing</li>\n                <li>Access other branches</li>\n              </ul>\n            </div>\n          ",
    "3": "\n            Chef, Head Barista, Sales Bar Manager. Operational leadership of their department.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>Manage recipes, products in their area</li>\n                <li>View inventory &amp; low-stock alerts</li>\n                <li>Assign responsibilities to staff</li>\n                <li>View shift schedule</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>Finance module</li>\n                <li>Staff payroll data</li>\n                <li>Branch-level settings</li>\n              </ul>\n            </div>\n          ",
    "4": "\n            Shift supervisor. Intermediate role between leading and employee.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>Approve time corrections</li>\n                <li>View staff schedule</li>\n                <li>Process POS transactions</li>\n                <li>Handle opening/closing duties</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>Edit products or pricing</li>\n                <li>Access finance module</li>\n              </ul>\n            </div>\n          ",
    "5": "\n            Front-line staff. Role-specific screen access only.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>Barista/Waiter: create orders, process payments</li>\n                <li>Kitchen: view incoming orders only</li>\n                <li>Cleaning: view &amp; complete assigned tasks</li>\n                <li>Clock in/out</li>\n                <li>View own salary &amp; schedule</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>Inventory, finance, settings</li>\n                <li>Other staff data</li>\n                <li>Auto-logged out when shift ends</li>\n              </ul>\n            </div>\n          ",
    "6": "\n            Very limited access. Only basic task visibility.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>Clock in/out</li>\n                <li>View assigned tasks only</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>POS, inventory, finance, settings</li>\n                <li>Other staff info</li>\n              </ul>\n            </div>\n          ",
    "7": "\n            Loyalty app access only. Not a business user.\n            <div class=\"can-do\">\n              <div class=\"role-tag tag-green\">✓ Can do</div>\n              <ul>\n                <li>View points &amp; rewards</li>\n                <li>Spin the wheel</li>\n                <li>Receive campaigns &amp; notifications</li>\n                <li>View events &amp; offers</li>\n              </ul>\n            </div>\n            <div class=\"cannot-do\">\n              <div class=\"role-tag tag-red\">✗ Cannot do</div>\n              <ul>\n                <li>Any back-office screen</li>\n                <li>Note: Bolt integration explicitly excluded</li>\n              </ul>\n            </div>\n          "
  }
}